# 这个配置是用来给中文键盘输入做支持的，在用例开发人员反馈中文输入不能正确点击后
# 需要手动配置一个不能使用手机型号的键盘坐标位置
# key为phone_model_name  value tuple分别为（9键 键盘9个键的左上点xy，和右下点两个点xy的相对坐标）
# 前面好多还是绝对坐标  没有做改动
key_map_position = {
    # x1,y1,x2,y2
    "chiron": (0.16, 0.64, 0.83, 0.86),     # 1080*2160
    "polaris": (178, 1394, 901, 1852),
    "OPPO F15": (178, 1673, 901, 2093),  # f15  1080*2400
    "OPPO A91": (178, 1673, 901, 2093),  # a91  1080*2400
    "OPPO Reno2 Z": (178, 1595, 901, 2037),  # reno2Z
    "OPPO F9": (178, 1595, 901, 2037), # F9 1080*2340
    "OPPO F9 Pro": (178, 1595, 901, 2037), # F9 PRO  1080*2340
    "OPPO R15 梦镜版": (185, 1487, 892, 1955),  # r15 梦境版  1080*2280
    "OPPO R15x": (185, 1627, 892, 2110),  # R15x 1080*2340
    "IPhone12 Pro": (0.171, 0.657, 0.826, 0.843),  # R15x 1080*2340
    "ROO": (0.15, 0.648, 0.846, 0.864),  # Nokia 黑色保密壳
    'MIX2': (0.2, 0.6, 0.83, 0.8)
}

default_key_map_position = (0.171, 0.681, 0.826, 0.89)
